num = int(input("введи число > "))
if num % 2 == 0:
    print(f"Число {num} является четным")
    if (num  2) % 2 == 0:
        print(f"Произведение числа {num} само на себя является четным")
    else:
        print(f"Произведение числа {num} само на себя не является четным")
else:
    print(f"Число {num} не является четным")
    if (num  2) % 2 == 0:
        print(f"Произведение числа {num} само на себя является четным")
    else:
        print(f"Произведение числа {num} само на себя не является четным")